#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

aws_ecr_repository.lanchonete-api-ecr: Refreshing state... [id=tech-challenge-lanchonete/orders]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.lanchonete-api-ecr must be replaced
-/+ resource "aws_ecr_repository" "lanchonete-api-ecr" {
      ~ arn                  = "arn:aws:ecr:us-east-1:045628470274:repository/tech-challenge-lanchonete/orders" -> (known after apply)
      ~ id                   = "tech-challenge-lanchonete/orders" -> (known after apply)
      ~ name                 = "tech-challenge-lanchonete/orders" -> "tech-challenge-lanchonete/lanchonete-api" # forces replacement
      ~ registry_id          = "045628470274" -> (known after apply)
      ~ repository_url       = "045628470274.dkr.ecr.us-east-1.amazonaws.com/tech-challenge-lanchonete/orders" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecr_repository = "tech-challenge-lanchonete/orders" -> "tech-challenge-lanchonete/lanchonete-api"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @anadezuo, Action: `pull_request`*